# Data Transformation

In this notebook, we look into some of the central data transformation techniques. For more data transformation techniques, see the book [Python for Data Analysis, 3E](https://wesmckinney.com/book/) by Wes McKinney.

In [1]:
import numpy as np
import pandas as pd

## Grouping and aggregation

Sometimes we want to calculate various functions on particular subgroups of a dataset. For instance, in the exercise last time, we asked the following question for the "adult" dataset: *"Is the average hours per week (worked) different across different marital-status groups?"*. That is, we asked for the average of `hours-per-week` for each categorical value of the variable `marital-status`. Such calculations are common and easily done using pandas.

In [2]:
from ucimlrepo import fetch_ucirepo 
  
# fetch dataset 
adult = fetch_ucirepo(id=2) 
  
# data (as pandas dataframes) 
X = adult.data.features 
y = adult.data.targets

In [3]:
X

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,39,Private,215419,Bachelors,13,Divorced,Prof-specialty,Not-in-family,White,Female,0,0,36,United-States
48838,64,NaN,321403,HS-grad,9,Widowed,NaN,Other-relative,Black,Male,0,0,40,United-States
48839,38,Private,374983,Bachelors,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,50,United-States
48840,44,Private,83891,Bachelors,13,Divorced,Adm-clerical,Own-child,Asian-Pac-Islander,Male,5455,0,40,United-States
48841,35,Self-emp-inc,182148,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60,United-States

To get the mean hours-per-week per marital-status, we can take out the `hours-per-week` column and group it by the `marital-status` column:

In [4]:
hgbm = X["hours-per-week"].groupby(X["marital-status"])
hgbm

This will give us a grouped object. We can now aggregate the `hours-per-week` for each marital status using various functions (methods) such as mean or median:

In [5]:
hgbm.mean()

marital-status
Divorced                 41.115483
Married-AF-spouse        39.810811
Married-civ-spouse       43.306984
Married-spouse-absent    39.684713
Never-married            36.891357
Separated                39.667974
Widowed                  33.438076
Name: hours-per-week, dtype: float64

In [6]:
hgbm.median()

marital-status
Divorced                 40.0
Married-AF-spouse        40.0
Married-civ-spouse       40.0
Married-spouse-absent    40.0
Never-married            40.0
Separated                40.0
Widowed                  40.0
Name: hours-per-week, dtype: float64

We can also count how many cases there are in each group:

In [7]:
hgbm.count()

marital-status
Divorced                  6633
Married-AF-spouse           37
Married-civ-spouse       22379
Married-spouse-absent      628
Never-married            16117
Separated                 1530
Widowed                   1518
Name: hours-per-week, dtype: int64

Or get several describtive statics at once using `describe`:

In [8]:
hgbm.describe()

,count,mean,std,min,25%,50%,75%,max
marital-status,,,,,,,,
Divorced,6633.0,41.115483,10.782276,1.0,40.00,40.0,45.0,99.0
Married-AF-spouse,37.0,39.810811,17.074734,3.0,35.00,40.0,42.0,90.0
Married-civ-spouse,22379.0,43.306984,12.036199,1.0,40.00,40.0,50.0,99.0
Married-spouse-absent,628.0,39.684713,12.151461,3.0,37.00,40.0,40.0,99.0
Never-married,16117.0,36.891357,12.308909,1.0,30.00,40.0,40.0,99.0
Separated,1530.0,39.667974,10.353571,2.0,38.00,40.0,40.0,99.0
Widowed,1518.0,33.438076,14.345342,1.0,23.25,40.0,40.0,99.0

We can also group by multiple categorical variables:

In [9]:
hgbmg = X["hours-per-week"].groupby([X["marital-status"], X["sex"]])
hgbmg

In [10]:
hgbmg.count()

marital-status         sex
Divorced               Female     4001
                       Male       2632
Married-AF-spouse      Female       25
                       Male         12
Married-civ-spouse     Female     2480
                       Male      19899
Married-spouse-absent  Female      304
                       Male        324
Never-married          Female     7218
                       Male       8899
Separated              Female      931
                       Male        599
Widowed                Female     1233
                       Male        285
Name: hours-per-week, dtype: int64

In [11]:
hgbmg.mean()

marital-status         sex
Divorced               Female    39.535116
                       Male      43.517857
Married-AF-spouse      Female    34.320000
                       Male      51.250000
Married-civ-spouse     Female    36.586694
                       Male      44.144530
Married-spouse-absent  Female    37.069079
                       Male      42.138889
Never-married          Female    34.952341
                       Male      38.464097
Separated              Female    38.128894
                       Male      42.060100
Widowed                Female    32.906732
                       Male      35.736842
Name: hours-per-week, dtype: float64

We can also group the entire dataframe by a categorical variable:

In [12]:
Xg = X.groupby("marital-status")
Xg

We can then subset specific columns and aggregate those:

In [13]:
Xg["age"].mean()

marital-status
Divorced                 43.159204
Married-AF-spouse        31.945946
Married-civ-spouse       43.353724
Married-spouse-absent    40.613057
Never-married            28.128064
Separated                39.725490
Widowed                  59.377470
Name: age, dtype: float64

In [14]:
Xg[["age", "hours-per-week"]].mean()

                             age  hours-per-week
marital-status
Divorced               43.159204       41.115483
Married-AF-spouse      31.945946       39.810811
Married-civ-spouse     43.353724       43.306984
Married-spouse-absent  40.613057       39.684713
Never-married          28.128064       36.891357
Separated              39.725490       39.667974
Widowed                59.377470       33.438076

Or calculate aggregations of all nummeric columns:

In [15]:
Xg.mean(numeric_only=True)

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
marital-status,,,,,,
Divorced,43.159204,184749.693954,10.052917,793.675562,67.654304,41.115483
Married-AF-spouse,31.945946,184132.675676,10.432432,2971.621622,84.756757,39.810811
Married-civ-spouse,43.353724,186790.582510,10.303275,1739.700612,120.619509,43.306984
Married-spouse-absent,40.613057,197523.157643,9.377389,629.004777,63.184713,39.684713
Never-married,28.128064,195450.902836,9.972141,384.382639,54.126078,36.891357
Separated,39.725490,202974.111111,9.270588,581.842484,56.618954,39.667974
Widowed,59.377470,175529.942688,9.088274,603.644269,81.620553,33.438076

### Aggregating with abitrary functions

`mean`, `median`, ... etc. are some of the most common statistical functions and they are explicit methods on the DataFrames and Series. However, sometimes one wants to aggregate by another function that is not a method on the DataFrame or Series. This functionality is also possible in pandas.

For instance, you might want to calculate the range of a variable, that is the max value minus the min value. To do this, we first create the function we want to aggregate by (in this case range), and then use the `agg` method on the grouped object:

In [16]:
def data_range(x):
    return (x.max() - x.min())

In [17]:
Xg[["age"]].agg(data_range)

                       age
marital-status
Divorced                72
Married-AF-spouse       56
Married-civ-spouse      73
Married-spouse-absent   70
Never-married           73
Separated               72
Widowed                 73

Or if we want to apply it on the entire dataframe we need the range function to check for numeric type

In [18]:
from pandas.api.types import is_numeric_dtype

def data_range(x):
    if is_numeric_dtype(x):
        return (x.max() - x.min())
    else:
        return np.nan

Xg.agg(data_range)

,age,workclass,fnlwgt,education,education-num,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country
marital-status,,,,,,,,,,,,,
Divorced,72,NaN,1470936,NaN,15,NaN,NaN,NaN,NaN,99999,3900,98,NaN
Married-AF-spouse,56,NaN,524413,NaN,10,NaN,NaN,NaN,NaN,99999,1651,87,NaN
Married-civ-spouse,73,NaN,1476908,NaN,15,NaN,NaN,NaN,NaN,99999,2603,98,NaN
Married-spouse-absent,70,NaN,1248282,NaN,15,NaN,NaN,NaN,NaN,99999,3004,96,NaN
Never-married,73,NaN,1105433,NaN,15,NaN,NaN,NaN,NaN,99999,3770,98,NaN
Separated,72,NaN,1435127,NaN,15,NaN,NaN,NaN,NaN,99999,3900,97,NaN
Widowed,73,NaN,933674,NaN,15,NaN,NaN,NaN,NaN,99999,4356,98,NaN

You can also use `agg` to get the aggregation by multiple functions:

In [19]:
Xg[["age"]].agg([np.mean, np.median, np.std])

C:\Users\Jacob\AppData\Local\Temp\ipykernel_22052\3387305571.py:1: FutureWarning: The provided callable <function mean at 0x000002C02EBA2700> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  Xg[["age"]].agg([np.mean, np.median, np.std])
C:\Users\Jacob\AppData\Local\Temp\ipykernel_22052\3387305571.py:1: FutureWarning: The provided callable <function median at 0x000002C02ED11120> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  Xg[["age"]].agg([np.mean, np.median, np.std])
C:\Users\Jacob\AppData\Local\Temp\ipykernel_22052\3387305571.py:1: FutureWarning: The provided callable <function std at 0x000002C02EBA2840> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  Xg[["age"]].agg([np.mean, np.median, np.std])

                             age
                            mean median        std
marital-status
Divorced               43.159204   42.0  10.554028
Married-AF-spouse      31.945946   30.0  10.697731
Married-civ-spouse     43.353724   42.0  12.074762
Married-spouse-absent  40.613057   40.0  12.852678
Never-married          28.128064   25.0   9.950846
Separated              39.725490   39.0  10.779031
Widowed                59.377470   60.0  12.208438

Or if you want the columns named:

In [20]:
Xg[["age"]].agg([("Mean age", np.mean), ("Median age", np.median), ("Standard deviatio of age", np.std)])

C:\Users\Jacob\AppData\Local\Temp\ipykernel_22052\3801134906.py:1: FutureWarning: The provided callable <function mean at 0x000002C02EBA2700> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  Xg[["age"]].agg([("Mean age", np.mean), ("Median age", np.median), ("Standard deviatio of age", np.std)])
C:\Users\Jacob\AppData\Local\Temp\ipykernel_22052\3801134906.py:1: FutureWarning: The provided callable <function median at 0x000002C02ED11120> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  Xg[["age"]].agg([("Mean age", np.mean), ("Median age", np.median), ("Standard deviatio of age", np.std)])
C:\Users\Jacob\AppData\Local\Temp\ipykernel_22052\3801134906.py:1: FutureWarning: The provided callable <function std at 0x000002C02EBA2840> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  Xg[["age"]].agg([("Mean age", np.mean), ("Median age", np.median), ("Standard deviatio of age", np.std)])

                             age
                        Mean age Median age Standard deviatio of age
marital-status
Divorced               43.159204       42.0                10.554028
Married-AF-spouse      31.945946       30.0                10.697731
Married-civ-spouse     43.353724       42.0                12.074762
Married-spouse-absent  40.613057       40.0                12.852678
Never-married          28.128064       25.0                 9.950846
Separated              39.725490       39.0                10.779031
Widowed                59.377470       60.0                12.208438

As these aggregation functions are also methods on the dataframe, as the warning tell us, we can just write `"mean"` instead of `np.mean` for instance:

In [21]:
Xg[["age"]].agg([("Mean age", "mean"), ("Median age", "median"), ("Standard deviatio of age", "std")])

                             age
                        Mean age Median age Standard deviatio of age
marital-status
Divorced               43.159204       42.0                10.554028
Married-AF-spouse      31.945946       30.0                10.697731
Married-civ-spouse     43.353724       42.0                12.074762
Married-spouse-absent  40.613057       40.0                12.852678
Never-married          28.128064       25.0                 9.950846
Separated              39.725490       39.0                10.779031
Widowed                59.377470       60.0                12.208438

## Joins

Sometimes our data comes in multiple dataframes or tables, and we want to combine them into one for doing machine learning, for instance. We use joins just like in SQL to do this in python.

In [22]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"], "data1": pd.Series(range(7), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "d"], "data2": pd.Series(range(3), dtype="Int64")})

In [23]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [24]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

The `merge` function from Pandas do an inner join:

In [25]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

Specifying keys

In [26]:
pd.merge(df1, df2, on="key")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

If the key is named differently in the two dataframes

In [27]:
df3 = df2.rename(columns={"key": "key_other"})
df3

  key_other  data2
0         a      0
1         b      1
2         d      2

In [28]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [29]:
pd.merge(df1, df3, left_on="key", right_on="key_other")

  key  data1 key_other  data2
0   b      0         b      1
1   b      1         b      1
2   a      2         a      0
3   a      4         a      0
4   a      5         a      0
5   b      6         b      1

Doing an outer, left or right join:

In [30]:
pd.merge(df1, df2, on="key", how = "outer")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [31]:
pd.merge(df1, df2, on="key", how = "left")

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   c      3   <NA>
4   a      4      0
5   a      5      0
6   b      6      1

In [32]:
pd.merge(df1, df2, on="key", how = "right")

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   d   <NA>      2

### Using indexes for joins

Sometimes the keys we want to join on are in the indexes of the data frames instead of in a column. To join, we can just turn the index into a column.

In [33]:
df4 = df1.set_index('key')
df4

     data1
key
b        0
b        1
a        2
c        3
a        4
a        5
b        6

As you can see above, `df4` contains the keys in the index. We can move the indexes into a column using `reset_index`:

In [34]:
df4 = df4.reset_index()
df4

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

Now we can merge as usual:

In [35]:
pd.merge(df4, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

## Pivoting

Sometimes we want to make our dataframe wider or longer, that is move information between the columns names and the column values.

### Pivoting long to wide

In [36]:
long_df = pd.DataFrame({"student_id" : [1,1,2,2,2,3,3],
                       "class" : ["algebra", "databases","algebra", "databases", "creative writing", "algebra", "databases"],
                       "grade" : [7, 10, 4, 2, 10, 4, 12]})

In [37]:
long_df

   student_id             class  grade
0           1           algebra      7
1           1         databases     10
2           2           algebra      4
3           2         databases      2
4           2  creative writing     10
5           3           algebra      4
6           3         databases     12

In [38]:
long_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  7 non-null      int64
 1   class       7 non-null      object
 2   grade       7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

We want to make it "wider", in the sense that we want one row per student, and then a column for each class.

In [39]:
long_df.pivot(index = "student_id", columns="class", values="grade")

class       algebra  creative writing  databases
student_id
1               7.0               NaN       10.0
2               4.0              10.0        2.0
3               4.0               NaN       12.0

Note that the Â´student_idÂ´ column is turned into the index. If we want to keep it as a column we can do:

In [40]:
long_df.pivot(index = "student_id", columns="class", values="grade").reset_index()

class  student_id  algebra  creative writing  databases
0               1      7.0               NaN       10.0
1               2      4.0              10.0        2.0
2               3      4.0               NaN       12.0

The metod `pivot_table` is a more general method that allow for more functionality if needed.

### Pivoting wide to long

In [41]:
wide_df = pd.DataFrame({"Country" : ["Denmark", "Denmark", "Sweden", "Sweden"],
                       "Type" : ["population", "infected", "population", "infected",],
                       "2001" : [5000, 1, 9500, 2],
                       "2002" : [5050, 3, 9550, 4],
                       "2003" : [5100, 6, 9650, 8],
                       "2004" : [5150, 10, 9700, 9]})

In [42]:
wide_df

   Country        Type  2001  2002  2003  2004
0  Denmark  population  5000  5050  5100  5150
1  Denmark    infected     1     3     6    10
2   Sweden  population  9500  9550  9650  9700
3   Sweden    infected     2     4     8     9

In [43]:
wide_df.melt(id_vars = ["Country", "Type"], value_vars = ["2001", "2002", "2003", "2004"])

    Country        Type variable  value
0   Denmark  population     2001   5000
1   Denmark    infected     2001      1
2    Sweden  population     2001   9500
3    Sweden    infected     2001      2
4   Denmark  population     2002   5050
5   Denmark    infected     2002      3
6    Sweden  population     2002   9550
7    Sweden    infected     2002      4
8   Denmark  population     2003   5100
9   Denmark    infected     2003      6
10   Sweden  population     2003   9650
11   Sweden    infected     2003      8
12  Denmark  population     2004   5150
13  Denmark    infected     2004     10
14   Sweden  population     2004   9700
15   Sweden    infected     2004      9

You might want to rename the `variable` and  `value` column afterwards:

In [44]:
wide_df.melt(id_vars = ["Country", "Type"], value_vars = ["2001", "2002", "2003", "2004"]).rename(columns={"variable": "Year", "value": "Size"})

    Country        Type  Year  Size
0   Denmark  population  2001  5000
1   Denmark    infected  2001     1
2    Sweden  population  2001  9500
3    Sweden    infected  2001     2
4   Denmark  population  2002  5050
5   Denmark    infected  2002     3
6    Sweden  population  2002  9550
7    Sweden    infected  2002     4
8   Denmark  population  2003  5100
9   Denmark    infected  2003     6
10   Sweden  population  2003  9650
11   Sweden    infected  2003     8
12  Denmark  population  2004  5150
13  Denmark    infected  2004    10
14   Sweden  population  2004  9700
15   Sweden    infected  2004     9

## Creating new columns from mapping

We can easily create a new column with a high-level categorization from a column that might have more values using the mapping functionality:

In [45]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
# A dictionary mapping
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [47]:
data["food"].map(meat_to_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [48]:
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [49]:
# Defining a function to do the mapping (here based on the dictionary!)
def get_animal(x):
    return meat_to_animal[x]

In [50]:
data = data.drop("animal", axis = 1)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [51]:
data["animal"] = data["food"].map(get_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## Transforming a categorical variable into dummy variables

In [52]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Let us turn the categorical variable `animal` into dummy variables:

In [53]:
pd.get_dummies(data["animal"])

     cow    pig  salmon
0  False   True   False
1  False   True   False
2  False   True   False
3   True  False   False
4   True  False   False
5  False   True   False
6   True  False   False
7  False   True   False
8  False  False    True

If we want the values to be 0 and 1 (int or float):

In [54]:
pd.get_dummies(data["animal"], dtype = "int")

   cow  pig  salmon
0    0    1       0
1    0    1       0
2    0    1       0
3    1    0       0
4    1    0       0
5    0    1       0
6    1    0       0
7    0    1       0
8    0    0       1

If we want to add the dummies to the original dataframe we can do the following steps:

In [55]:
dummies = pd.get_dummies(data["animal"], prefix="dummy", dtype=float)
dummies

   dummy_cow  dummy_pig  dummy_salmon
0        0.0        1.0           0.0
1        0.0        1.0           0.0
2        0.0        1.0           0.0
3        1.0        0.0           0.0
4        1.0        0.0           0.0
5        0.0        1.0           0.0
6        1.0        0.0           0.0
7        0.0        1.0           0.0
8        0.0        0.0           1.0

In [56]:
data_with_dummies = data.join(dummies)
data_with_dummies

          food  ounces  animal  dummy_cow  dummy_pig  dummy_salmon
0        bacon     4.0     pig        0.0        1.0           0.0
1  pulled pork     3.0     pig        0.0        1.0           0.0
2        bacon    12.0     pig        0.0        1.0           0.0
3     pastrami     6.0     cow        1.0        0.0           0.0
4  corned beef     7.5     cow        1.0        0.0           0.0
5        bacon     8.0     pig        0.0        1.0           0.0
6     pastrami     3.0     cow        1.0        0.0           0.0
7    honey ham     5.0     pig        0.0        1.0           0.0
8     nova lox     6.0  salmon        0.0        0.0           1.0

We might want to drop the original column:

In [57]:
data_with_dummies = data_with_dummies.drop("animal", axis = "columns")
data_with_dummies

          food  ounces  dummy_cow  dummy_pig  dummy_salmon
0        bacon     4.0        0.0        1.0           0.0
1  pulled pork     3.0        0.0        1.0           0.0
2        bacon    12.0        0.0        1.0           0.0
3     pastrami     6.0        1.0        0.0           0.0
4  corned beef     7.5        1.0        0.0           0.0
5        bacon     8.0        0.0        1.0           0.0
6     pastrami     3.0        1.0        0.0           0.0
7    honey ham     5.0        0.0        1.0           0.0
8     nova lox     6.0        0.0        0.0           1.0

**Note: When training machine learning models, it is often problematic if multiple column perfectly correlates. Here `dummy_cow` perfectly correlates with the two columns `dummy_pig` and `dummy_salmon`, in the sense that `dummy_cow = 1 - dummy_pig - dummy_salmon`. Thus one usually drops one of the dummy columns.**